/*
마인드맵				한장
명세서				한장
use case			한장			UML		// 실무에서 UML 은 장난. 책이 하나 나온다
class diagram		한장			UML		//
sequence diagram	많으면 두세장	UML		// 메서드 이름으로 쓰지 말고 한글로 쓸것
업무 분장				한장

이렇게 초안

발표 시 바뀐 부분 적용해서 다시 보여주고
코딩하다 보면 늘어나게 된다.

업무 분장

	시간
인원	업무
인원	업무


서버 가장 먼저 짤 것.
동시에 디자인 및 자료조사

MM
10 Man Month 한 사람이 10달 해야 되는 일일 수도 있고
			두 사람이 5달 해야 하는 일일 수도 있고, 이렇게 일의 단위를 따짐


담 주 수업 없음
상담 + 코딩
	17담주 화요일부터 토, 일 스케쥴 짜고 

23일 다담주 월요일 추가로 시연화면 들어가면 됨.


네트워크
하겠다던 기능

마인드맵-> 회의할 때마다 한 사람은 계속 그리는 것이 편리
이름, 주제, 마인드맵으로, 
그 다음 어떻게 표시할 건지 uml로 




마인드맵


네트워크, 파일 입출력(반드시 들어갈 필요능 없음)
쓰레드는 네트워크에 들어갈 것
gui 구성

자료조사,



// UML
	/ 첫 장 마인드맵
	/ 둘 장 요구명세서
	/ 셋 장 유즈케이스
	/ 클래스 다이어그램
		// 셋터 겟터 정도는 안 써도 되
		// 변수인데 내부적으로만 써 / 이것도 안 써도 되
		// 클래스 간의 관계도를 그리는 것이기 때문에
		// 클래스 간 써야하는 변수, 메서드만

	/ 순차 다이어그램
	/ 스케쥴(업무 분장)
	// 여유가 있으면 클라이언트에 gui 정도는 그려올 것

통합된 사용언어, 의사 소통 할 수 있는 언어로 만들면 된다.
		//반드시 앞에서 발표하는 사람이 질문에 대답.
가시화 언어
	시각적인 그래픽형태로 작성
	표기법에는 명확한 정의가 존재

// USE case
	위에서 아래로 순서대로 내려와야 ㅎ마
	큰 기능을 묶어
	프로그램에 이벤트를 날릴 수 있는 사람 = actor (cf. 시스템 포함)

// 순차 다이어그램 / 제일 나중에
	만들었다는 가정하에 하나하나씩 따라가는 것

*/